In [1]:
import pandas as pd

# Series

In [2]:
data = [1, 2, 3, 4, 5]

In [5]:
s = pd.Series(data)

In [6]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
#creating index
index = ['Linha' + str(i) for i in range(5)]

In [8]:
# showing index
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [13]:
#assigning index in the first column
s = pd.Series(data = data, index = index)

In [12]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [14]:

data = {'Linha' + str(i) : i + 1 for i in range(5)}

In [15]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [16]:
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [17]:
#sum + 2 on each line in variable 's'
s1 = s + 2

In [18]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [20]:
# sum variable 's' with variable 's1' 
s2 = s + s1
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# DataFrames

In [62]:
#hybrid list
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

In [63]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [64]:
df1 = pd.DataFrame(data = data)

In [65]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [66]:

index = ['Line' + str(i) for i in range(3)]

In [67]:
index

['Line0', 'Line1', 'Line2']

In [68]:
df1 = pd.DataFrame(data = data, index = index)

In [69]:
df1

       0  1  2
Line0  1  2  3
Line1  4  5  6
Line2  7  8  9

In [70]:
columns = ['Column' + str(i) for i in range(3)]

In [71]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [72]:
df1

       Column0  Column1  Column2
Line0        1        2        3
Line1        4        5        6
Line2        7        8        9

In [73]:
data = {'Column0': {'Line0': 1, 'Line1': 4, 'Line2': 7},
        'Column1': {'Line0': 2, 'Line1': 5, 'Line2': 8},
        'Column2': {'Line0': 3, 'Line1': 6, 'Line2': 9}}

In [74]:
data

{'Column0': {'Line0': 1, 'Line1': 4, 'Line2': 7},
 'Column1': {'Line0': 2, 'Line1': 5, 'Line2': 8},
 'Column2': {'Line0': 3, 'Line1': 6, 'Line2': 9}}

In [75]:
df2 = pd.DataFrame(data)

In [76]:
df2

       Column0  Column1  Column2
Line0        1        2        3
Line1        4        5        6
Line2        7        8        9

In [77]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [78]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [79]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [80]:
df3

       Column0  Column1  Column2
Line0        1        2        3
Line1        4        5        6
Line2        7        8        9

In [81]:
df1[df1 > 0] = 'A'
df1

      Column0 Column1 Column2
Line0       A       A       A
Line1       A       A       A
Line2       A       A       A

In [82]:
df2[df2 > 0] = 'B'
df2

      Column0 Column1 Column2
Line0       B       B       B
Line1       B       B       B
Line2       B       B       B

In [83]:
df3[df3 > 0] = 'C'
df3

      Column0 Column1 Column2
Line0       C       C       C
Line1       C       C       C
Line2       C       C       C

In [84]:
#cocatenating df1, df2, df3 (three DataFrames)
df4 = pd.concat([df1, df2, df3])
df4

      Column0 Column1 Column2
Line0       A       A       A
Line1       A       A       A
Line2       A       A       A
Line0       B       B       B
Line1       B       B       B
Line2       B       B       B
Line0       C       C       C
Line1       C       C       C
Line2       C       C       C

In [85]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

      Column0 Column1 Column2 Column0 Column1 Column2 Column0 Column1 Column2
Line0       A       A       A       B       B       B       C       C       C
Line1       A       A       A       B       B       B       C       C       C
Line2       A       A       A       B       B       B       C       C       C